app/Http/Livewire/SearchItem.php

select count(*) as aggregate from `items` where MATCH (name) AGAINST ('' IN BOOLEAN MODE)
---
    public function render()
    {
        $item = Item::search($this->term)->paginate(10);