app/Http/Controllers/AjaxCOntroller.php

    public function searchStore(Request $request){
        $query = $request->get('query');
        $output = '';
        if($query != ''){
            $data = Store::where('store_name', 'like', '%'.$query.'%')->where('status_activation', 1)->get();
---
select * from `stores` where `store_name` like '%na%' and `status_activation` = 1