app/Http/Controllers/DashboardController.php

                $reject = Store::where('id_mitra', Auth::user()->id)->where('status_activation', 2)->get();
                $banding = Store::where('id_mitra', Auth::user()->id)->where('status_activation', 3)->get();
                $mitra = User::find(Auth::user()->id);
                return view('mitra.index', [
                    'item' => $data->count(),
                    'non_aktif' => $nonaktif->count(),
                    'aktif' => $aktif->count(),
                    'reject' => $reject->count(),
                    'banding' => $banding->count(),
                    'mitra' => $mitra,
                ]);
---
select * from `stores` where `status_activation` = 1
select * from `items`